       IDENTIFICATION DIVISION.
       PROGRAM-ID. PerguntarNome.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NOME        PIC X(30).
       01 RESPOSTA    PIC X(30).

       PROCEDURE DIVISION.
       INICIO.
           DISPLAY "Qual é o seu nome?"
           ACCEPT NOME
           DISPLAY "Qual é o seu nome?"
           
           DISPLAY "Meu nome é Agatha"
           ACCEPT RESPOSTA
           DISPLAY "Meu nome é Agatha"

           STOP RUN.
